# Terraform - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production/runs/run-3uUDbScCheeuo94X

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-vekDd67krpaAbwSL]
module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-oSE524WGbAWrEMVE]
module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-YhtQo8LQ3kb9gQtj]
module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-StWu3aUPDPVAEJnx]
module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-fpMbsEfUqbxPrjtW]
module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-v5rUHBx3hnAqf8EU]
module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-iq6U1p9r6qqCNDSJ]
module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-4Xxjb5r2nza4kknd]
module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-fqEb4Q3qhSyXf5ev]
module.customer.tfe_workspace.customer: Refreshing state... [id=ws-puJfbRKD4QSNyk2o]
module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-SuZCQPwTmnyMRXX8]
module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-Qt3LLvwfD8j2BYv7]
module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-hkFvbMuK3vzFuNsL]
module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-7FQCfXAzeSZNsyvm]
module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-zU98QY68PyZWgWNY]
module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-TmBDwhdrHRv8svx9]
module.identity.tfe_workspace.identity: Refreshing state... [id=ws-T2CHFSgXk1mWAEiK]
module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-GsNRj4ZUszrmfvpx]
module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-aGi3DhrgbGJCCL5P]
module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-LBP1qA4rwDAPmrBG]
module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-JcMiHRvmPSSSr3JR]
module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-RJ8QTjP4oSqTXcMU]
tfe_project.default: Refreshing state... [id=prj-Ypb929xZ3ud4DFWL]
module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-T1Qogdhg9GNJzxw8]
module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-VBkDdzo8C6RdkqBE]
module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-qDvxgbEWdy8JAJg3]
module.organization.tfe_workspace.organization: Refreshing state... [id=ws-nWeQ4VMWb4niqKEb]
module.shared.tfe_workspace.shared: Refreshing state... [id=ws-LQG3h7RP6XjPAHgY]
module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-yDD8Rxs3zKJPCaTP]
module.common.data.tfe_organization.default: Refreshing...
module.common.data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
module.common.data.tfe_workspace.default: Refreshing...
module.common.data.tfe_workspace.default: Refresh complete after 0s [id=ws-UmJqcbXkYoY7jfTM]
module.common.data.tfe_variables.default: Refreshing...
module.common.data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-UmJqcbXkYoY7jfTM]
module.shared.tfe_workspace.shared: Drift detected (update)
module.customer.tfe_workspace.customer: Drift detected (update)
module.identity.tfe_workspace.identity_api: Drift detected (update)
module.organization.tfe_workspace.organization: Drift detected (update)
module.organization.tfe_workspace.organization_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # tfe_project.default will be destroyed
  # (because tfe_project.default is not in configuration)
  - resource "tfe_project" "default" {
      - id           = "prj-Ypb929xZ3ud4DFWL" -> null
      - name         = "production" -> null
      - organization = "connectilly" -> null
    }

  # module.common.tfe_project.default will be created
  + resource "tfe_project" "default" {
      + id           = (known after apply)
      + name         = "production"
      + organization = "connectilly"
    }

  # module.customer.tfe_variable.customer_api_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-TmBDwhdrHRv8svx9" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fqEb4Q3qhSyXf5ev" -> null
    }

  # module.customer.tfe_variable.customer_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-oSE524WGbAWrEMVE" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fqEb4Q3qhSyXf5ev" -> null
    }

  # module.customer.tfe_variable.customer_api_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-zU98QY68PyZWgWNY" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fqEb4Q3qhSyXf5ev" -> null
    }

  # module.customer.tfe_variable.customer_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-SuZCQPwTmnyMRXX8" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-puJfbRKD4QSNyk2o" -> null
    }

  # module.customer.tfe_variable.customer_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-vekDd67krpaAbwSL" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-puJfbRKD4QSNyk2o" -> null
    }

  # module.customer.tfe_variable.customer_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-VBkDdzo8C6RdkqBE" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-puJfbRKD4QSNyk2o" -> null
    }

  # module.customer.tfe_workspace.customer will be destroyed
  # (because tfe_workspace.customer is not in configuration)
  - resource "tfe_workspace" "customer" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-customer" -> null
      - id                            = "ws-puJfbRKD4QSNyk2o" -> null
      - name                          = "production-customer" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 6 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "customer",
          - "production",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/customer/shared/infrastructure/workspaces/production" -> null
    }

  # module.customer.tfe_workspace.customer_api will be destroyed
  # (because tfe_workspace.customer_api is not in configuration)
  - resource "tfe_workspace" "customer_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-customer-api" -> null
      - id                            = "ws-fqEb4Q3qhSyXf5ev" -> null
      - name                          = "production-customer-api" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 0 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "customer",
          - "production",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/customer/customer-api/infrastructure/workspaces/production" -> null
    }

  # module.identity.tfe_variable.identity_api_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-LBP1qA4rwDAPmrBG" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qDvxgbEWdy8JAJg3" -> null
    }

  # module.identity.tfe_variable.identity_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-T1Qogdhg9GNJzxw8" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qDvxgbEWdy8JAJg3" -> null
    }

  # module.identity.tfe_variable.identity_api_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-JcMiHRvmPSSSr3JR" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qDvxgbEWdy8JAJg3" -> null
    }

  # module.identity.tfe_variable.identity_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-RJ8QTjP4oSqTXcMU" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-T2CHFSgXk1mWAEiK" -> null
    }

  # module.identity.tfe_variable.identity_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-v5rUHBx3hnAqf8EU" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-T2CHFSgXk1mWAEiK" -> null
    }

  # module.identity.tfe_variable.identity_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-Qt3LLvwfD8j2BYv7" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-T2CHFSgXk1mWAEiK" -> null
    }

  # module.identity.tfe_workspace.identity will be destroyed
  # (because tfe_workspace.identity is not in configuration)
  - resource "tfe_workspace" "identity" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-identity" -> null
      - id                            = "ws-T2CHFSgXk1mWAEiK" -> null
      - name                          = "production-identity" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 0 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "identity",
          - "production",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/identity/shared/infrastructure/workspaces/production" -> null
    }

  # module.identity.tfe_workspace.identity_api will be destroyed
  # (because tfe_workspace.identity_api is not in configuration)
  - resource "tfe_workspace" "identity_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-identity-api" -> null
      - id                            = "ws-qDvxgbEWdy8JAJg3" -> null
      - name                          = "production-identity-api" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 16 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "identity",
          - "production",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/identity/identity-api/infrastructure/workspaces/production" -> null
    }

  # module.organization.tfe_variable.organization_api_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-7FQCfXAzeSZNsyvm" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fpMbsEfUqbxPrjtW" -> null
    }

  # module.organization.tfe_variable.organization_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-yDD8Rxs3zKJPCaTP" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fpMbsEfUqbxPrjtW" -> null
    }

  # module.organization.tfe_variable.organization_api_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-GsNRj4ZUszrmfvpx" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-fpMbsEfUqbxPrjtW" -> null
    }

  # module.organization.tfe_variable.organization_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-StWu3aUPDPVAEJnx" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-nWeQ4VMWb4niqKEb" -> null
    }

  # module.organization.tfe_variable.organization_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-YhtQo8LQ3kb9gQtj" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-nWeQ4VMWb4niqKEb" -> null
    }

  # module.organization.tfe_variable.organization_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-4Xxjb5r2nza4kknd" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-nWeQ4VMWb4niqKEb" -> null
    }

  # module.organization.tfe_workspace.organization will be destroyed
  # (because tfe_workspace.organization is not in configuration)
  - resource "tfe_workspace" "organization" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-organization" -> null
      - id                            = "ws-nWeQ4VMWb4niqKEb" -> null
      - name                          = "production-organization" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 6 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "organization",
          - "production",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/organization/shared/infrastructure/workspaces/production" -> null
    }

  # module.organization.tfe_workspace.organization_api will be destroyed
  # (because tfe_workspace.organization_api is not in configuration)
  - resource "tfe_workspace" "organization_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-organization-api" -> null
      - id                            = "ws-fpMbsEfUqbxPrjtW" -> null
      - name                          = "production-organization-api" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 16 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "organization",
          - "production",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/organization/organization-api/infrastructure/workspaces/production" -> null
    }

  # module.shared.tfe_variable.shared_aws_access_key_id will be destroyed
  # (because tfe_variable.shared_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "shared_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-aGi3DhrgbGJCCL5P" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-LQG3h7RP6XjPAHgY" -> null
    }

  # module.shared.tfe_variable.shared_aws_secret_access_key will be destroyed
  # (because tfe_variable.shared_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "shared_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-iq6U1p9r6qqCNDSJ" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-LQG3h7RP6XjPAHgY" -> null
    }

  # module.shared.tfe_variable.shared_cockroach_api_key will be destroyed
  # (because tfe_variable.shared_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "shared_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-hkFvbMuK3vzFuNsL" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-LQG3h7RP6XjPAHgY" -> null
    }

  # module.shared.tfe_workspace.shared will be destroyed
  # (because tfe_workspace.shared is not in configuration)
  - resource "tfe_workspace" "shared" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/production-shared" -> null
      - id                            = "ws-LQG3h7RP6XjPAHgY" -> null
      - name                          = "production-shared" -> null
      - operations                    = true -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-Ypb929xZ3ud4DFWL" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 0 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "production",
          - "shared",
        ] -> null
      - terraform_version             = "1.4.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
      - working_directory             = "./src/shared/infrastructure/workspaces/production" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_api_upstash_api_key will be created
  + resource "tfe_variable" "customer_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_aws_access_key_id will be created
  + resource "tfe_variable" "customer_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_cockroach_api_key will be created
  + resource "tfe_variable" "customer_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_variable.customer_upstash_api_key will be created
  + resource "tfe_variable" "customer_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.customer.tfe_workspace.customer will be created
  + resource "tfe_workspace" "customer" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-customer"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/shared/infrastructure/workspaces/production"
    }

  # module.common.module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-customer-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/customer/customer-api/infrastructure/workspaces/production"
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_access_key_id will be created
  + resource "tfe_variable" "identity_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_cockroach_api_key will be created
  + resource "tfe_variable" "identity_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_api_upstash_api_key will be created
  + resource "tfe_variable" "identity_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_aws_access_key_id will be created
  + resource "tfe_variable" "identity_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_cockroach_api_key will be created
  + resource "tfe_variable" "identity_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_variable.identity_upstash_api_key will be created
  + resource "tfe_variable" "identity_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.identity.tfe_workspace.identity will be created
  + resource "tfe_workspace" "identity" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-identity"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "identity",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/shared/infrastructure/workspaces/production"
    }

  # module.common.module.identity.tfe_workspace.identity_api will be created
  + resource "tfe_workspace" "identity_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-identity-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "identity",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/identity/identity-api/infrastructure/workspaces/production"
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_access_key_id will be created
  + resource "tfe_variable" "organization_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_cockroach_api_key will be created
  + resource "tfe_variable" "organization_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_api_upstash_api_key will be created
  + resource "tfe_variable" "organization_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_aws_access_key_id will be created
  + resource "tfe_variable" "organization_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_cockroach_api_key will be created
  + resource "tfe_variable" "organization_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_variable.organization_upstash_api_key will be created
  + resource "tfe_variable" "organization_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.organization.tfe_workspace.organization will be created
  + resource "tfe_workspace" "organization" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-organization"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "organization",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/shared/infrastructure/workspaces/production"
    }

  # module.common.module.organization.tfe_workspace.organization_api will be created
  + resource "tfe_workspace" "organization_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-organization-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "organization",
          + "production",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/organization/organization-api/infrastructure/workspaces/production"
    }

  # module.common.module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_variable.shared_upstash_api_key will be created
  + resource "tfe_variable" "shared_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common.module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "production-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "production",
          + "shared",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/production"
    }

Plan: 36 to add, 0 to change, 29 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*